{
    "projects": [
        {
            "name": "The Blue Path",
            "fr": "Jeu de plateforme et d'exploration, <b>The Blue Path</b> propose une odyssée d'une gouttelette à travers de nombreux paysages minéraux.<br>Une goutte d'eau s'aventure dans un voyage à travers une faille géologique vers une nappe phréatique profondément cachée.<br><br>C'est une vertical slice réalisé comme projet indépendant sur <b>Unreal Engine 5</b>.<br><br>J'ai travaillé dessus en tant que <b>seul et unique développeur</b> parmis une équipe composée de quatre autres personnes. J'ai donc développé tous les aspects du prototype, du gameplay</b> aux différents <b>systèmes</b> en passant par l'</b>UI</b>, le<b> gamefeel</b>, etc.<br><br>Vous pouvez retrouver plus d'informations sur <a href=\"https://sibyllion.itch.io/the-blue-path\" target=\"_blank\" style=\"font-size: 16px;\">la page itch.io du jeu.</a>",
            "en": "An exploration platformer, <b>The Blue Path</b> takes a droplet on an odyssey through a variety of mineral landscapes.<br>A drop of water ventures across a geological fault to a deeply hidden water table.<br><br>This is a vertical slice produced as an independent project on <b>Unreal Engine 5</b>.<br><br>I worked on it as the <b>one and only developer</b> in a team of four other people. So I developed all aspects of the prototype, from <b>gameplay</b> to the various <b>systems</b>, including the <b>UI</b>, <b>gamefeel</b> and so on.<br><br>You can find more information on <a href=\"https://sibyllion.itch.io/the-blue-path\" target=\"_blank\" style=\"font-size: 16px;\">itch.io page.</a>"
        },
        {
            "name": "Bet'N'Die",
            "fr": "Un jeu d'arène en ligne pour 4 joueurs, mêlant FPS et mécanismes de pari, dans un cadre d'arcade-casino. Pariez sur les machines tout en combattant. Le gagnant est celui qui parvient à sécuriser le plus de jetons possible dans LA BANQUE.<br><br> C'est le projet de fin d'études que j'ai mené, au sein d'une équipe de vingt personnes, à ISART Digital.<br> Il a été développé sur une version custom d'<b>Unreal Engine</b> 4.26.<br><br>J'ai été l'un des co-lanceurs de ce projet. Entre juin et septembre 2021, mes deux collègues et moi-même nous sommes consacrés au développement d'un concept qui introduisait un USP de paris dans un FPS. Notre projet a été sélectionné par l'équipe éducative et est considéré comme l'un des projets les plus ambitieux jamais entrepris par Isart Digital. Malgré les défis, tels que la gestion d'un serveur dédié et la coordination avec une équipe de 20 membres, nous avons réussi à terminer le jeu dans les temps.<br><br>D'un point de vue programmation, j'ai essentiellement travaillé sur les feedbacks des différents éléments interactifs comme les machines de paris, les machines d'armes et la banque.",
            "en": "An online arena game for 4 players, combining FPS and betting mechanisms, in an arcade-casino setting. Bet on machines as you fight. The winner is the player who manages to secure the most tokens in THE VAULT.<br><br> This is the graduation project I carried out as part of a team of twenty people at ISART Digital.<br>It was developed on a custom version of <b>Unreal Engine</b> 4.26.<br><br>I served as one of the co-pitchers for this project. Between June and September 2021, my two colleagues and I dedicated ourselves to developing a concept that introduced a unique selling point (USP) of betting in a first-person shooter (FPS). Our project was selected by the educational team and is regarded as one of the most ambitious endeavors ever undertaken at Isart Digital. Despite the challenges, such as managing a dedicated server and coordinating with a team of 20 members, we successfully completed the game on time.<br><br>From a programming point of view, I mainly worked on feedback for the various interactive elements, such as the betting machines, the weapons machines and the vault."
        }
    ]
}